БылковД.А_70180166/src/Documents/ПриказОбОтчислении/ПриказОбОтчислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбОтчислении</name>
  <basedOn>Document.ПротоколЗаседанияКомиссии</basedOn>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженности</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПросроченныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПротоколЗаседанияКомиссии</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Documents/ПриказОбОтчислении/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПриказОбОтчислении.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОбОтчислении.Группа,
	|	ПриказОбОтчислении.Дата,
	|	ПриказОбОтчислении.КоличествоПросроченныхЗадолженностей,
	|	ПриказОбОтчислении.НаправленияПодготовки,
	|	ПриказОбОтчислении.Номер,
	|	ПриказОбОтчислении.Основание,
	|	ПриказОбОтчислении.Семестр,
	|	ПриказОбОтчислении.Студент
	|ИЗ
	|	Документ.ПриказОбОтчислении КАК ПриказОбОтчислении
	|ГДЕ
	|	ПриказОбОтчислении.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
